In [1]:
    #ADD A ROW OR COLUMN TO YOUR DF
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt


dict={
    'name':['bhanu','ramu','vishnu'],
    'place':['etah','warangal','daman'],
    'cpi':[9.63,8.9,9.43]
}

In [2]:
df=pd.DataFrame(dict)
df

     name     place   cpi
0   bhanu      etah  9.63
1    ramu  warangal  8.90
2  vishnu     daman  9.43

In [8]:
df.index = ['day1','d2','d3']
df

       cpi     name:place    name     place
day1  9.63     bhanu:etah   bhanu      etah
d2    8.90  ramu:warangal    ramu  warangal
d3    9.43   vishnu:daman  vishnu     daman

In [11]:
df.loc['day1']

cpi                 9.63
name:place    bhanu:etah
name               bhanu
place               etah
Name: day1, dtype: object

In [23]:
df.loc['day1':'d3','cpi':'place']

       cpi     name:place    name     place
day1  9.63     bhanu:etah   bhanu      etah
d2    8.90  ramu:warangal    ramu  warangal
d3    9.43   vishnu:daman  vishnu     daman

In [3]:
#combining colulmns
#suppose we want to add name and place with : separated

df['name:place']=df['name']+':'+df['place']   #in this way we can add a column
df

     name     place   cpi     name:place
0   bhanu      etah  9.63     bhanu:etah
1    ramu  warangal  8.90  ramu:warangal
2  vishnu     daman  9.43   vishnu:daman

In [4]:
#removing the columns
#now suppose after storig information of name and address in one place we want to delete the name and address columns
df.drop(columns=['name','place'],inplace=True)

In [5]:
df

    cpi     name:place
0  9.63     bhanu:etah
1  8.90  ramu:warangal
2  9.43   vishnu:daman

In [6]:
#now splitting a string to get our name and place
df[['name','place']]=df['name:place'].str.split(':',expand=True)
df

    cpi     name:place    name     place
0  9.63     bhanu:etah   bhanu      etah
1  8.90  ramu:warangal    ramu  warangal
2  9.43   vishnu:daman  vishnu     daman

In [7]:
#adding and removing rows from our df
# adding a single row of data
#use append method
df.append({'cpi':6.00,'name':'Bharat','place':'churu'},ignore_index=True)
#NOTE--here ignore index is too much required. It is required when we are appending anything but number of items are different
#missing values are NaN

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
#ADDING THE DATAFRAMES---
dict2={
    'place':['freedabad','rajsthan'],
    'name':['ayush sharma','bharat mahariya'],
    'first':['ayush','bharat'],
    'second':['sharma','mahariya']
}

df2=pd.DataFrame(dict2)
df2

       place             name   first    second
0  freedabad     ayush sharma   ayush    sharma
1   rajsthan  bharat mahariya  bharat  mahariya

In [ ]:
df=df.append(df2,ignore_index=True,sort=False)

<ipython-input-29-4f215145ccb9>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(df2,ignore_index=True,sort=False)

In [ ]:
#REMOVING ROWS
df.drop(index=[3,4],inplace=True)

In [ ]:
#removing the row based on some information
#suppose we want to the row where name is ramu
i=df[df['name']=='ramu'].index  #here filter return the row and .index method gives the index of that row
df.drop(i)

    cpi    name:place    name  place first second
0  9.63    bhanu:etah   bhanu   etah   NaN    NaN
2  9.43  vishnu:daman  vishnu  daman   NaN    NaN